results/freebsd/db_mid.txt
Running 1m test @ http://192.168.122.142:3000/db
  8 threads and 200 connections
  Thread calibration: mean lat.: 2.947ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.957ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.963ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.955ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.952ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.945ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.962ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.966ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.97ms  436.00us   9.76ms   69.22%
    Req/Sec   671.30    112.74     1.11k    76.77%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.99ms
 75.000%    3.23ms
 90.000%    3.48ms
 99.000%    4.05ms
 99.900%    5.19ms
 99.990%    7.19ms
 99.999%    9.67ms
100.000%    9.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.051     0.000000            1         1.00
       2.383     0.100000        25115         1.11
       2.569     0.200000        50101         1.25
       2.745     0.300000        75067         1.43
       2.887     0.400000       100057         1.67
       2.995     0.500000       124806         2.00
       3.043     0.550000       137371         2.22
       3.089     0.600000       149810         2.50
       3.133     0.650000       162368         2.86
       3.177     0.700000       174596         3.33
       3.227     0.750000       187373         4.00
       3.253     0.775000       193490         4.44
       3.283     0.800000       199787         5.00
       3.317     0.825000       205821         5.71
       3.359     0.850000       212205         6.67
       3.411     0.875000       218362         8.00
       3.443     0.887500       221494         8.89
       3.481     0.900000       224590        10.00
       3.523     0.912500       227598        11.43
       3.571     0.925000       230689        13.33
       3.631     0.937500       233813        16.00
       3.667     0.943750       235415        17.78
       3.703     0.950000       236956        20.00
       3.743     0.956250       238500        22.86
       3.787     0.962500       240018        26.67
       3.837     0.968750       241619        32.00
       3.861     0.971875       242356        35.56
       3.887     0.975000       243150        40.00
       3.915     0.978125       243953        45.71
       3.945     0.981250       244738        53.33
       3.977     0.984375       245487        64.00
       3.997     0.985938       245883        71.11
       4.017     0.987500       246269        80.00
       4.039     0.989062       246654        91.43
       4.063     0.990625       247048       106.67
       4.093     0.992188       247441       128.00
       4.111     0.992969       247626       142.22
       4.135     0.993750       247831       160.00
       4.163     0.994531       248017       182.86
       4.211     0.995313       248212       213.33
       4.287     0.996094       248399       256.00
       4.367     0.996484       248492       284.44
       4.467     0.996875       248590       320.00
       4.567     0.997266       248688       365.71
       4.663     0.997656       248785       426.67
       4.791     0.998047       248881       512.00
       4.851     0.998242       248930       568.89
       4.939     0.998437       248980       640.00
       4.999     0.998633       249032       731.43
       5.079     0.998828       249078       853.33
       5.215     0.999023       249126      1024.00
       5.283     0.999121       249151      1137.78
       5.355     0.999219       249174      1280.00
       5.447     0.999316       249198      1462.86
       5.555     0.999414       249222      1706.67
       5.811     0.999512       249247      2048.00
       5.935     0.999561       249259      2275.56
       6.211     0.999609       249271      2560.00
       6.415     0.999658       249283      2925.71
       6.527     0.999707       249295      3413.33
       6.699     0.999756       249308      4096.00
       6.807     0.999780       249314      4551.11
       6.975     0.999805       249320      5120.00
       7.031     0.999829       249326      5851.43
       7.083     0.999854       249333      6826.67
       7.131     0.999878       249338      8192.00
       7.167     0.999890       249341      9102.22
       7.359     0.999902       249344     10240.00
       7.419     0.999915       249347     11702.86
       7.447     0.999927       249350     13653.33
       7.599     0.999939       249353     16384.00
       7.975     0.999945       249355     18204.44
       8.215     0.999951       249356     20480.00
       8.735     0.999957       249358     23405.71
       8.935     0.999963       249359     27306.67
       9.127     0.999969       249361     32768.00
       9.223     0.999973       249362     36408.89
       9.223     0.999976       249362     40960.00
       9.463     0.999979       249363     46811.43
       9.487     0.999982       249364     54613.33
       9.655     0.999985       249365     65536.00
       9.655     0.999986       249365     72817.78
       9.655     0.999988       249365     81920.00
       9.671     0.999989       249366     93622.86
       9.671     0.999991       249366    109226.67
       9.695     0.999992       249367    131072.00
       9.695     0.999993       249367    145635.56
       9.695     0.999994       249367    163840.00
       9.695     0.999995       249367    187245.71
       9.695     0.999995       249367    218453.33
       9.767     0.999996       249368    262144.00
       9.767     1.000000       249368          inf
#[Mean    =        2.972, StdDeviation   =        0.436]
#[Max     =        9.760, Total count    =       249368]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  299796 requests in 1.00m, 52.04MB read
Requests/sec:   4996.38
Transfer/sec:      0.87MB