results/freebsd/fileio_high.txt
Running 1m test @ http://192.168.122.142:3000/fileio
  8 threads and 500 connections
  Thread calibration: mean lat.: 1.253ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.239ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.241ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.240ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.244ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.246ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.256ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.262ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.24ms   19.98ms 457.22ms   98.57%
    Req/Sec     1.32k   248.44     4.89k    90.57%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.00ms
 75.000%    1.36ms
 90.000%    1.78ms
 99.000%   71.49ms
 99.900%  274.17ms
 99.990%  296.96ms
 99.999%  304.38ms
100.000%  457.47ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.075     0.000000            1         1.00
       0.398     0.100000        49736         1.11
       0.573     0.200000        99415         1.25
       0.726     0.300000       149345         1.43
       0.866     0.400000       198933         1.67
       1.003     0.500000       248768         2.00
       1.070     0.550000       273632         2.22
       1.137     0.600000       298281         2.50
       1.206     0.650000       323108         2.86
       1.278     0.700000       347931         3.33
       1.358     0.750000       372761         4.00
       1.404     0.775000       385326         4.44
       1.454     0.800000       397534         5.00
       1.513     0.825000       410060         5.71
       1.581     0.850000       422382         6.67
       1.667     0.875000       434908         8.00
       1.717     0.887500       441067         8.89
       1.777     0.900000       447303        10.00
       1.850     0.912500       453437        11.43
       1.948     0.925000       459678        13.33
       2.099     0.937500       465845        16.00
       2.225     0.943750       468962        17.78
       2.425     0.950000       472076        20.00
       2.783     0.956250       475165        22.86
       3.453     0.962500       478270        26.67
       4.519     0.968750       481382        32.00
       5.587     0.971875       482931        35.56
       7.283     0.975000       484479        40.00
       9.167     0.978125       486033        45.71
      11.735     0.981250       487587        53.33
      16.399     0.984375       489136        64.00
      24.671     0.985938       489913        71.11
      38.623     0.987500       490691        80.00
      53.791     0.989062       491466        91.43
      87.039     0.990625       492242       106.67
     129.919     0.992188       493018       128.00
     148.223     0.992969       493409       142.22
     169.855     0.993750       493797       160.00
     186.879     0.994531       494188       182.86
     201.087     0.995313       494571       213.33
     214.911     0.996094       494961       256.00
     221.695     0.996484       495156       284.44
     227.199     0.996875       495348       320.00
     234.879     0.997266       495544       365.71
     242.047     0.997656       495737       426.67
     250.495     0.998047       495930       512.00
     255.231     0.998242       496028       568.89
     259.967     0.998437       496124       640.00
     264.959     0.998633       496237       731.43
     269.311     0.998828       496318       853.33
     274.687     0.999023       496421      1024.00
     278.015     0.999121       496466      1137.78
     280.063     0.999219       496520      1280.00
     282.111     0.999316       496561      1462.86
     285.695     0.999414       496610      1706.67
     287.999     0.999512       496659      2048.00
     288.767     0.999561       496687      2275.56
     289.535     0.999609       496711      2560.00
     291.071     0.999658       496732      2925.71
     292.607     0.999707       496759      3413.33
     293.887     0.999756       496785      4096.00
     294.143     0.999780       496794      4551.11
     294.655     0.999805       496804      5120.00
     295.423     0.999829       496820      5851.43
     295.679     0.999854       496828      6826.67
     296.447     0.999878       496845      8192.00
     296.703     0.999890       496849      9102.22
     296.959     0.999902       496853     10240.00
     297.727     0.999915       496861     11702.86
     297.983     0.999927       496864     13653.33
     298.495     0.999939       496872     16384.00
     298.751     0.999945       496873     18204.44
     299.263     0.999951       496876     20480.00
     300.799     0.999957       496879     23405.71
     301.823     0.999963       496882     27306.67
     302.335     0.999969       496885     32768.00
     302.847     0.999973       496887     36408.89
     303.103     0.999976       496889     40960.00
     303.359     0.999979       496890     46811.43
     303.615     0.999982       496893     54613.33
     303.615     0.999985       496893     65536.00
     303.871     0.999986       496894     72817.78
     303.871     0.999988       496894     81920.00
     304.383     0.999989       496895     93622.86
     314.367     0.999991       496896    109226.67
     343.295     0.999992       496897    131072.00
     343.295     0.999993       496897    145635.56
     343.295     0.999994       496897    163840.00
     377.855     0.999995       496898    187245.71
     377.855     0.999995       496898    218453.33
     427.007     0.999996       496899    262144.00
     427.007     0.999997       496899    291271.11
     427.007     0.999997       496899    327680.00
     427.007     0.999997       496899    374491.43
     427.007     0.999998       496899    436906.67
     457.471     0.999998       496900    524288.00
     457.471     1.000000       496900          inf
#[Mean    =        3.235, StdDeviation   =       19.983]
#[Max     =      457.216, Total count    =       496900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  598713 requests in 1.00m, 77.08MB read
  Non-2xx or 3xx responses: 3
Requests/sec:   9978.05
Transfer/sec:      1.28MB